In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"]=(20,10)

In [2]:
housing=pd.read_csv("Housing.csv")
housing.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
housing.shape

(13320, 9)

In [4]:
housing.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [5]:
df1=housing.drop(['area_type','availability','society','balcony'],axis=1)
df1.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [6]:
df1.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [7]:
df2=df1.copy(deep=True)

In [8]:
df2['bath'].fillna(df2['bath'].median,inplace=True)

In [9]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath           0
price          0
dtype: int64

In [10]:
df2.dropna(inplace=True)

In [11]:
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [12]:
df2.shape

(13303, 5)

In [13]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [14]:
df2['Rooms']=df2['size'].apply(lambda x: int(x.split(' ')[0]))

In [15]:
df2.head()

                   location       size total_sqft bath   price  Rooms
0  Electronic City Phase II      2 BHK       1056  2.0   39.07      2
1          Chikka Tirupathi  4 Bedroom       2600  5.0  120.00      4
2               Uttarahalli      3 BHK       1440  2.0   62.00      3
3        Lingadheeranahalli      3 BHK       1521  3.0   95.00      3
4                  Kothanur      2 BHK       1200  2.0   51.00      2

In [16]:
df2['Rooms'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [17]:
df2[df2['Rooms']>20] #their is some error in data set

                       location        size total_sqft  bath  price  Rooms
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0     27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0     43

In [18]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [19]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [20]:
df2[~df2['total_sqft'].apply(is_float)].head(n=10)

,location,size,total_sqft,bath,price,Rooms
30,Yelahanka,4 BHK,2100 - 2850,4.0,186.000,4
56,Devanahalli,4 Bedroom,3010 - 3410,<bound method NDFrame._add_numeric_operations....,192.000,4
81,Hennur Road,4 Bedroom,2957 - 3450,<bound method NDFrame._add_numeric_operations....,224.500,4
122,Hebbal,4 BHK,3067 - 8156,4.0,477.000,4
137,8th Phase JP Nagar,2 BHK,1042 - 1105,2.0,54.005,2
165,Sarjapur,2 BHK,1145 - 1340,2.0,43.490,2
188,KR Puram,2 BHK,1015 - 1540,2.0,56.800,2
224,Devanahalli,3 BHK,1520 - 1740,<bound method NDFrame._add_numeric_operations....,74.820,3
410,Kengeri,1 BHK,34.46Sq. Meter,1.0,18.500,1
549,Hennur Road,2 BHK,1195 - 1440,2.0,63.770,2

In [21]:
def convert_sqft_range(x):
    t=x.split('-')
    if len(t)==2:
        return (float(t[0])+float(t[1]))/2
    try:
        return float(x)
    except:
        return None

In [22]:
df3=df2.copy() #by default deep copy is true
df3['total_sqft']=df3['total_sqft'].apply(convert_sqft_range)

In [23]:
df3.head()

                   location       size  total_sqft bath   price  Rooms
0  Electronic City Phase II      2 BHK      1056.0  2.0   39.07      2
1          Chikka Tirupathi  4 Bedroom      2600.0  5.0  120.00      4
2               Uttarahalli      3 BHK      1440.0  2.0   62.00      3
3        Lingadheeranahalli      3 BHK      1521.0  3.0   95.00      3
4                  Kothanur      2 BHK      1200.0  2.0   51.00      2

In [24]:
df3[~df3['total_sqft'].apply(is_float)].head(n=10)

Empty DataFrame
Columns: [location, size, total_sqft, bath, price, Rooms]
Index: []

In [26]:
df4=df3.copy()
df4['price_per_sqft']=df4['price']*100000/df4['total_sqft']
df4.head()

,location,size,total_sqft,bath,price,Rooms,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [35]:
len(df4.location.unique())

1304

In [38]:
df4.location=df4.location.apply(lambda x:x.strip())

location_data=df4.groupby('location')['location'].agg('count').sort_values(ascending=False)
print(location_data)

location
Whitefield               540
Sarjapur  Road           397
Electronic City          304
Kanakpura Road           273
Thanisandra              237
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Karnataka Shabarimala      1
whitefiled                 1
Name: location, Length: 1293, dtype: int64

In [39]:
len(location_data[location_data<=10])

1052

In [40]:
location_data_other=location_data[location_data<=10]

In [41]:
df4.location=df4.location.apply(lambda x: 'other' if x in location_data_other else x)
len(df4.location.unique())

242

In [43]:
df4.head(n=10)

,location,size,total_sqft,bath,price,Rooms,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,370.00,6,36274.509804